
&НаКлиенте
Процедура Расчет(Команда)     
	Для каждого Урок Из Объект.РасписаниеНаДень Цикл
		Если Урок.Мероприятие.Пустая() И ЗначениеЗаполнено(Урок.ВидУрока) Тогда
			Урок.Мероприятие = СоздатьМероприятие(Урок.НомерСтроки - 1)		
		КонецЕсли;                                                     	
	КонецЦикла;                                                        
КонецПроцедуры                                                         

Функция СоздатьМероприятие(ИндексСтроки)
	ТС = Объект.РасписаниеНаДень[ИндексСтроки];
	НовоеМероприятие = Документы.Мероприятие.СоздатьДокумент();
	КодУрока = Число(ТС.НомерСтроки);
	Урок = Справочники.ВремяУроков.НайтиПоКоду(КодУрока);
	НовоеМероприятие.Номер = "У-" + ТС.НомерСтроки;
	НовоеМероприятие.Дата = НачалоДня(Объект.Дата) + (Урок.ВремяНачала - '00010101');
	НовоеМероприятие.ТипМероприятия = Справочники.ТипыМероприятий.Урок;
	НовоеМероприятие.ВидМероприятия = ТС.ВидУрока;
	НовоеМероприятие.Записать();
	Возврат НовоеМероприятие.Ссылка
КонецФункции // СоздатьМероприятие()      


&НаКлиенте
Процедура РасписаниеНаДеньВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "РасписаниеНаДеньМероприятие" Тогда
		СтандартнаяОбработка = Ложь;
		Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.Мероприятие) Тогда
			ОткрытьЗначение(Элемент.ТекущиеДанные.Мероприятие);		
		КонецЕсли;                                             	
	КонецЕсли;                                                 
КонецПроцедуры


