
&НаКлиенте
Процедура ПодтвердитьЗавершение(Команда)
	ПровестиМероприятия()
КонецПроцедуры             

Процедура ПровестиМероприятия()
	Обработка = РеквизитФормыВЗначение("Объект");
	Для каждого Строка Из Объект.УрокиДня Цикл
		Если Строка.Был И (Строка.Урок.Проведен = Ложь) Тогда
			Мероприятие = Строка.Урок.ПолучитьОбъект();
			Мероприятие.Записать(РежимЗаписиДокумента.Проведение);
			Продолжить;	
		КонецЕсли;     
		Если (Строка.Был = Ложь) И (Строка.Урок.Проведен = Истина) Тогда
			Мероприятие = Строка.Урок.ПолучитьОбъект();
			Мероприятие.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			Продолжить;	
		КонецЕсли;     
	КонецЦикла;        
КонецПроцедуры


&НаКлиенте
Процедура ДеньПриИзменении(Элемент)
	ОбновитьСписокУроков()
КонецПроцедуры                  

Процедура ОбновитьСписокУроков()
	Обработка = РеквизитФормыВЗначение("Объект");
	Обработка.УрокиДня.Очистить();  
	Обработка.УрокиДня.Загрузить(Документы.Мероприятие.УрокиДня(Объект.День));
	ЗначениеВРеквизитФормы(Обработка, "Объект")
КонецПроцедуры


