Функция УрокиДня(День) Экспорт
   	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Мероприятие.Ссылка КАК Урок,
		|	Мероприятие.Проведен КАК Был
		|ИЗ
		|	Документ.Мероприятие КАК Мероприятие
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(Мероприятие.Дата, ДЕНЬ) = &День
		|	И Мероприятие.ТипМероприятия = ЗНАЧЕНИЕ(Справочник.ТипыМероприятий.Урок)";
	
	Запрос.УстановитьПараметр("День", День);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	// ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	// Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	// КонецЦикла;                                         
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА  
	Возврат РезультатЗапроса.Выгрузить();   
КонецФункции // УрокиДня()
