
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Занятость 
	Движения.Занятость.Записывать = Истина;
	Движение = Движения.Занятость.Добавить();
	Движение.Период = Дата;
	Движение.ТипМероприятия = ТипМероприятия;
	Движение.ВидМероприятия = ВидМероприятия;   
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ    
	
	КодУрока = Число(Прав(Номер, 1));
	Урок = Справочники.ВремяУроков.НайтиПоКоду(КодУрока);
	Движение.Секунды = Урок.ВремяЗавершения - Урок.ВремяНачала;

КонецПроцедуры
